<a href="https://colab.research.google.com/github/VivianeSouza923/HCIA_AI_HUAWEI_STUDY_if/blob/main/Lab_Introduction_to_Pandas_Turma_03.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#**Pandas**
* Data analysis and data handling
  * Read data
  * Clean data
  * Statistics of data
* It is built on top of NumPy
---
**Main data structures**
* Series: array with labeled index
* Dataframe: matrix with labeled index and columns

In [1]:
# importando as libs - a gente vai precisar do numpy, por motivos óbvios, para usar o pandas
import numpy as np
import pandas as pd

##Series

In [3]:
# criação da array aleatória de 5 números que serão sorteados dentro de 5 a 32 (exclusivo).
arr1 = np.random.randint(5, 32, 5)
#mostra
arr1

array([13, 24, 16, 17, 14])

In [4]:
# criação de series usando a array criada - Na serie, temos a labelização. Automaticamente, a série é labelizada com números de 0 a n, se você não passar os labels que deseja
#seriesCriar = pd.Series(arrayCriada)
series1 = pd.Series(arr1)
#mostra
series1

0    13
1    24
2    16
3    17
4    14
dtype: int64

In [5]:
# quero trocar os labels da minha serie:
#serieCriada = pd.Series(arrayCriada, ['label0', 'label1', ..., 'labeln'])
series1 = pd.Series(arr1, ['a', 'b', 'c', 'd', 'e'])
#mostra
series1

a    13
b    24
c    16
d    17
e    14
dtype: int64

In [6]:
# quer ver algum dado da série? Passa o label dele.
#serieCriada['label']
series1['b']

24

In [7]:
#mostrando a serie, de boa
series1

a    13
b    24
c    16
d    17
e    14
dtype: int64

In [9]:
# quer ver algum dado da série? Pode passar a posição também (lembrando que vai de 0 a n)
series1[2]

16

In [10]:
#criação de uma serie aleatória de 5 números dentro de 3 e 40(exclusivo), passando as labels que eu quero para esses 5
series2 = pd.Series(np.random.randint(3, 40, 5), ['a', 'b', 'c', 'd', 'e'])
#mostra
series2

a     7
b    16
c    37
d    31
e     9
dtype: int64

In [11]:
# soma de series --> soma como se fosse números normais
series1 + series2

a    20
b    40
c    53
d    48
e    23
dtype: int64

In [12]:
# criando series passando label com o dado logo, tipo fazendo biblioteca
pd.Series({'a': 5, 'b': 3, 'c': 8})

a    5
b    3
c    8
dtype: int64

In [13]:
# trazer a serie à tona
series1

a    13
b    24
c    16
d    17
e    14
dtype: int64

In [14]:
# não quero mais, quero deletar a serie
# del serieQueQueroDeletar
del series1

In [16]:
# testando se a deletação deu certo
series1

NameError: ignored

##DataFrames

In [17]:
# criação de uma matriz aleatória (de 100 a 499, é o que pode sair - randint), de shape 4x3
matrix1 = np.random.randint(100, 500, (4, 3))
#mostra
matrix1

array([[247, 104, 456],
       [380, 330, 147],
       [389, 198, 260],
       [362, 176, 138]])

In [18]:
# passar colunas e linhas
# columns = ['label0', 'label1',..., 'labeln']
columns = ['CE', 'MA', 'PI']
# rows = ['label0', 'label1',..., 'labeln']
rows = ['Jan', 'Fev', 'Mar', 'Abr']

In [ ]:
#continuar
data_frame1 = pd.DataFrame(matrix1, rows, columns)
data_frame1

      CE   MA   PI
Jan  470  321  121
Fev  173  420  264
Mar  462  285  208
Abr  196  284  229

In [ ]:
type(data_frame1)

pandas.core.frame.DataFrame

In [ ]:
data_frame1['MA']

Jan    321
Fev    420
Mar    285
Abr    284
Name: MA, dtype: int64

In [ ]:
type(data_frame1['MA'])

pandas.core.series.Series

In [ ]:
data_frame1[['CE', 'PI']]

      CE   PI
Jan  470  121
Fev  173  264
Mar  462  208
Abr  196  229

In [ ]:
data_frame1[ ['PI', 'CE'] ]

      PI   CE
Jan  121  470
Fev  264  173
Mar  208  462
Abr  229  196

In [ ]:
data_frame1['Total'] = data_frame1['CE'] + data_frame1['PI'] + data_frame1['MA']
data_frame1

      CE   MA   PI  Total
Jan  470  321  121    912
Fev  173  420  264    857
Mar  462  285  208    955
Abr  196  284  229    709

In [ ]:
data_frame1.columns

Index(['CE', 'MA', 'PI', 'Total'], dtype='object')

In [ ]:
data_frame1.index

Index(['Jan', 'Fev', 'Mar', 'Abr'], dtype='object')

In [ ]:
data_frame1.describe()

               CE          MA          PI       Total
count    4.000000    4.000000    4.000000    4.000000
mean   325.250000  327.500000  205.500000  858.250000
std    162.827874   64.023433   60.885138  107.279619
min    173.000000  284.000000  121.000000  709.000000
25%    190.250000  284.750000  186.250000  820.000000
50%    329.000000  303.000000  218.500000  884.500000
75%    464.000000  345.750000  237.750000  922.750000
max    470.000000  420.000000  264.000000  955.000000

In [ ]:
data_frame1.shape

(4, 4)

In [ ]:
data_frame1

      CE   MA   PI  Total
Jan  470  321  121    912
Fev  173  420  264    857
Mar  462  285  208    955
Abr  196  284  229    709

In [ ]:
data_frame1.loc['Fev']

CE       173
MA       420
PI       264
Total    857
Name: Fev, dtype: int64

In [ ]:
data_frame1.loc[['Mar', 'Fev', 'Abr']]

      CE   MA   PI  Total
Mar  462  285  208    955
Fev  173  420  264    857
Abr  196  284  229    709

In [ ]:
data_frame1.iloc[1]

CE       173
MA       420
PI       264
Total    857
Name: Fev, dtype: int64

In [ ]:
data_frame1.loc[['Mar', 'Jan'], ['Total', 'CE']]

     Total   CE
Mar    955  462
Jan    912  470

In [ ]:
data_frame1

      CE   MA   PI  Total
Jan  470  321  121    912
Fev  173  420  264    857
Mar  462  285  208    955
Abr  196  284  229    709

In [ ]:
data_frame1['MA'] > 300

Jan     True
Fev     True
Mar    False
Abr    False
Name: MA, dtype: bool

In [ ]:
data_frame1[data_frame1['MA'] > 300]

      CE   MA   PI  Total
Jan  470  321  121    912
Fev  173  420  264    857

In [ ]:
data_frame1[data_frame1['MA'] > 300][['CE', 'PI']]

      CE   PI
Jan  470  121
Fev  173  264

In [ ]:
data_frame1

      CE   MA   PI  Total
Jan  470  321  121    912
Fev  173  420  264    857
Mar  462  285  208    955
Abr  196  284  229    709

In [ ]:
data_frame2 = pd.DataFrame([[1, 2, 3, 4]], ['Mai'], ['CE', 'MA', 'PI', 'Total'])
data_frame2

     CE  MA  PI  Total
Mai   1   2   3      4

In [ ]:
data_frame3 = pd.concat([data_frame1, data_frame2])

In [ ]:
data_frame3

      CE   MA   PI  Total
Jan  470  321  121    912
Fev  173  420  264    857
Mar  462  285  208    955
Abr  196  284  229    709
Mai    1    2    3      4

In [ ]:
data_frame3  = data_frame3.drop('Mai')

In [ ]:
data_frame3

      CE   MA   PI  Total
Jan  470  321  121    912
Fev  173  420  264    857
Mar  462  285  208    955
Abr  196  284  229    709

In [ ]:
data_frame1 = data_frame3.drop('Total', axis=1)

In [ ]:
data_frame1

      CE   MA   PI
Jan  470  321  121
Fev  173  420  264
Mar  462  285  208
Abr  196  284  229

In [ ]:
data_frame1 * 2

      CE   MA   PI
Jan  940  642  242
Fev  346  840  528
Mar  924  570  416
Abr  392  568  458

##Data Input

In [ ]:
data_bank = pd.read_csv('/content/drive/MyDrive/IFCE - Huawei Academy/Lecture 03/dataset_bank.csv')
data_bank

      age            job  marital  education  ... pdays  previous poutcome   y
0      30     unemployed  married    primary  ...    -1         0  unknown  no
1      33       services  married  secondary  ...   339         4  failure  no
2      35     management   single   tertiary  ...   330         1  failure  no
3      30     management  married   tertiary  ...    -1         0  unknown  no
4      59    blue-collar  married  secondary  ...    -1         0  unknown  no
...   ...            ...      ...        ...  ...   ...       ...      ...  ..
4516   33       services  married  secondary  ...    -1         0  unknown  no
4517   57  self-employed  married   tertiary  ...    -1         0  unknown  no
4518   57     technician  married  secondary  ...    -1         0  unknown  no
4519   28    blue-collar  married  secondary  ...   211         3    other  no
4520   44   entrepreneur   single   tertiary  ...   249         7    other  no

[4521 rows x 17 columns]

**Data Set Information**: https://archive.ics.uci.edu/ml/datasets/bank+marketing

---

**Attribute Information**:

* age (numeric)
* job: type of job (categorical: 'admin.','blue-collar','entrepreneur','housemaid','management','retired','self-employed','services','student','technician','unemployed','unknown')
* marital: marital status (categorical: 'divorced','married','single','unknown'; note: 'divorced' means divorced or widowed)
* education: (categorical: 'basic.4y','basic.6y','basic.9y','high.school','illiterate','professional.course','university.degree','unknown')
* default: has credit in default? (categorical: 'no','yes','unknown')
* balance: amount of money in account
* housing: has housing loan? (categorical: 'no','yes','unknown')
* loan: has personal loan? (categorical: 'no','yes','unknown')
* contact: contact communication type (categorical: 'cellular','telephone')
* month: last contact month of year (categorical: 'jan', 'feb', 'mar', ..., 'nov', 'dec')
* day_of_week: last contact day of the week (categorical: 'mon','tue','wed','thu','fri')
* duration: last contact duration, in seconds (numeric). Important note: this attribute highly affects the output target (e.g., if duration=0 then y='no'). Yet, the duration is not known before a call is performed. Also, after the end of the call y is obviously known. Thus, this input should only be included for benchmark purposes and should be discarded if the intention is to have a realistic predictive model.
* campaign: number of contacts performed during this campaign and for this client (numeric, includes last contact)
* pdays: number of days that passed by after the client was last contacted from a previous campaign (numeric; 999 means client was not previously contacted)
* previous: number of contacts performed before this campaign and for this client (numeric)
* poutcome: outcome of the previous marketing campaign (categorical: 'failure','nonexistent','success')
* y: has the client subscribed a term deposit? (binary: 'yes','no')

In [ ]:
data_bank.head(7)

   age            job  marital  education  ... pdays  previous poutcome   y
0   30     unemployed  married    primary  ...    -1         0  unknown  no
1   33       services  married  secondary  ...   339         4  failure  no
2   35     management   single   tertiary  ...   330         1  failure  no
3   30     management  married   tertiary  ...    -1         0  unknown  no
4   59    blue-collar  married  secondary  ...    -1         0  unknown  no
5   35     management   single   tertiary  ...   176         3  failure  no
6   36  self-employed  married   tertiary  ...   330         2    other  no

[7 rows x 17 columns]

In [ ]:
data_bank.tail()

      age            job  marital  education  ... pdays  previous poutcome   y
4516   33       services  married  secondary  ...    -1         0  unknown  no
4517   57  self-employed  married   tertiary  ...    -1         0  unknown  no
4518   57     technician  married  secondary  ...    -1         0  unknown  no
4519   28    blue-collar  married  secondary  ...   211         3    other  no
4520   44   entrepreneur   single   tertiary  ...   249         7    other  no

[5 rows x 17 columns]

In [ ]:
data_bank.head()

   age          job  marital  education  ... pdays  previous poutcome   y
0   30   unemployed  married    primary  ...    -1         0  unknown  no
1   33     services  married  secondary  ...   339         4  failure  no
2   35   management   single   tertiary  ...   330         1  failure  no
3   30   management  married   tertiary  ...    -1         0  unknown  no
4   59  blue-collar  married  secondary  ...    -1         0  unknown  no

[5 rows x 17 columns]

In [ ]:
data_bank['marital'].unique()

array(['married', 'single', 'divorced'], dtype=object)

In [ ]:
data_bank['marital'].value_counts()

married     2797
single      1196
divorced     528
Name: marital, dtype: int64

In [ ]:
data_bank['job'].unique()

array(['unemployed', 'services', 'management', 'blue-collar',
       'self-employed', 'technician', 'entrepreneur', 'admin.', 'student',
       'housemaid', 'retired', 'unknown'], dtype=object)

In [ ]:
data_bank['job'].nunique()

12

In [ ]:
data_bank[data_bank['marital'] == 'divorced']

      age           job   marital  education  ... pdays  previous poutcome    y
20     38    management  divorced    unknown  ...    -1         0  unknown   no
21     42    management  divorced   tertiary  ...    -1         0  unknown   no
30     68       retired  divorced  secondary  ...    -1         0  unknown  yes
35     42        admin.  divorced  secondary  ...    -1         0  unknown   no
36     78       retired  divorced    primary  ...    -1         0  unknown  yes
...   ...           ...       ...        ...  ...   ...       ...      ...  ...
4469   36    management  divorced   tertiary  ...    -1         0  unknown   no
4487   49  entrepreneur  divorced  secondary  ...    -1         0  unknown   no
4499   45   blue-collar  divorced    primary  ...    -1         0  unknown   no
4506   42    unemployed  divorced   tertiary  ...    -1         0  unknown   no
4510   36    technician  divorced  secondary  ...    -1         0  unknown   no

[528 rows x 17 columns]

In [ ]:
data_bank.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4521 entries, 0 to 4520
Data columns (total 17 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   age        4521 non-null   int64
 1   job        4521 non-null   object
 2   marital    4521 non-null   object
 3   education  4521 non-null   object
 4   default    4521 non-null   object
 5   balance    4521 non-null   int64
 6   housing    4521 non-null   object
 7   loan       4521 non-null   object
 8   contact    4521 non-null   object
 9   day        4521 non-null   int64
 10  month      4521 non-null   object
 11  duration   4521 non-null   int64
 12  campaign   4521 non-null   int64
 13  pdays      4521 non-null   int64
 14  previous   4521 non-null   int64
 15  poutcome   4521 non-null   object
 16  y          4521 non-null   object
dtypes: int64(7), object(10)
memory usage: 600.6+ KB

In [ ]:
data_bank.head()

   age          job  marital  education  ... pdays  previous poutcome   y
0   30   unemployed  married    primary  ...    -1         0  unknown  no
1   33     services  married  secondary  ...   339         4  failure  no
2   35   management   single   tertiary  ...   330         1  failure  no
3   30   management  married   tertiary  ...    -1         0  unknown  no
4   59  blue-collar  married  secondary  ...    -1         0  unknown  no

[5 rows x 17 columns]

In [ ]:
data_bank.groupby('marital').mean()

                age      balance        day  ...  campaign      pdays  previous
marital                                      ...
divorced  45.475379  1122.390152  15.753788  ...  2.604167  38.827652  0.439394
married   43.454415  1463.195567  15.905971  ...  2.847336  38.466929  0.519128
single    33.927258  1460.414716  16.008361  ...  2.751672  43.220736  0.642977

[3 rows x 7 columns]

In [ ]:
data_bank.groupby('marital').mean().sort_values('age', ascending=False)

                age      balance        day  ...  campaign      pdays  previous
marital                                      ...
divorced  45.475379  1122.390152  15.753788  ...  2.604167  38.827652  0.439394
married   43.454415  1463.195567  15.905971  ...  2.847336  38.466929  0.519128
single    33.927258  1460.414716  16.008361  ...  2.751672  43.220736  0.642977

[3 rows x 7 columns]

In [ ]:
data_bank.groupby(['marital', 'education']).mean()

                          age      balance  ...      pdays  previous
marital  education                          ...
divorced primary    51.392405  1072.721519  ...  33.987342  0.417722
         secondary  43.496296   891.181481  ...  37.914815  0.422222
         tertiary   45.148387  1437.896774  ...  42.122581  0.509677
         unknown    50.375000  1849.333333  ...  43.750000  0.250000
married  primary    47.511407  1371.638783  ...  35.351711  0.484791
         secondary  42.404345  1272.911002  ...  39.652418  0.517870
         tertiary   41.777166  1860.719395  ...  36.764787  0.555708
         unknown    48.444444  1725.547009  ...  48.589744  0.461538
single   primary    37.013699  2065.753425  ...  34.205479  0.328767
         secondary  33.052545  1154.008210  ...  45.275862  0.600985
         tertiary   34.512821  1754.711538  ...  43.816239  0.735043
         unknown    34.652174  1562.173913  ...  24.260870  0.760870

[12 rows x 7 columns]

In [ ]:
data_bank.groupby(['education', 'marital']).mean()

                          age      balance  ...      pdays  previous
education marital                           ...
primary   divorced  51.392405  1072.721519  ...  33.987342  0.417722
          married   47.511407  1371.638783  ...  35.351711  0.484791
          single    37.013699  2065.753425  ...  34.205479  0.328767
secondary divorced  43.496296   891.181481  ...  37.914815  0.422222
          married   42.404345  1272.911002  ...  39.652418  0.517870
          single    33.052545  1154.008210  ...  45.275862  0.600985
tertiary  divorced  45.148387  1437.896774  ...  42.122581  0.509677
          married   41.777166  1860.719395  ...  36.764787  0.555708
          single    34.512821  1754.711538  ...  43.816239  0.735043
unknown   divorced  50.375000  1849.333333  ...  43.750000  0.250000
          married   48.444444  1725.547009  ...  48.589744  0.461538
          single    34.652174  1562.173913  ...  24.260870  0.760870

[12 rows x 7 columns]

##One Hot Encoding

In [ ]:
data_bank.head()

   age          job  marital  education  ... pdays  previous poutcome   y
0   30   unemployed  married    primary  ...    -1         0  unknown  no
1   33     services  married  secondary  ...   339         4  failure  no
2   35   management   single   tertiary  ...   330         1  failure  no
3   30   management  married   tertiary  ...    -1         0  unknown  no
4   59  blue-collar  married  secondary  ...    -1         0  unknown  no

[5 rows x 17 columns]

In [ ]:
one_hot = pd.get_dummies(data_bank['education'])
one_hot

      primary  secondary  tertiary  unknown
0           1          0         0        0
1           0          1         0        0
2           0          0         1        0
3           0          0         1        0
4           0          1         0        0
...       ...        ...       ...      ...
4516        0          1         0        0
4517        0          0         1        0
4518        0          1         0        0
4519        0          1         0        0
4520        0          0         1        0

[4521 rows x 4 columns]

In [ ]:
data_bank = pd.concat([data_bank, one_hot], axis=1)

In [ ]:
data_bank.head()

   age          job  marital  education  ... primary  secondary tertiary unknown
0   30   unemployed  married    primary  ...       1          0        0       0
1   33     services  married  secondary  ...       0          1        0       0
2   35   management   single   tertiary  ...       0          0        1       0
3   30   management  married   tertiary  ...       0          0        1       0
4   59  blue-collar  married  secondary  ...       0          1        0       0

[5 rows x 21 columns]

In [ ]:
data_bank = data_bank.drop('education', axis=1)
data_bank

      age            job  marital  ... secondary  tertiary unknown
0      30     unemployed  married  ...         0         0       0
1      33       services  married  ...         1         0       0
2      35     management   single  ...         0         1       0
3      30     management  married  ...         0         1       0
4      59    blue-collar  married  ...         1         0       0
...   ...            ...      ...  ...       ...       ...     ...
4516   33       services  married  ...         1         0       0
4517   57  self-employed  married  ...         0         1       0
4518   57     technician  married  ...         1         0       0
4519   28    blue-collar  married  ...         1         0       0
4520   44   entrepreneur   single  ...         0         1       0

[4521 rows x 20 columns]